In [124]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import sklearn as sk
pd.__version__

'2.3.0'

In [125]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

In [126]:
dataset = sns.load_dataset("titanic")
dataset.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [128]:
dataset["age"].fillna(dataset["age"].mean(), inplace=True)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

C:\Users\Soham\AppData\Local\Temp\ipykernel_16728\747528435.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["age"].fillna(dataset["age"].mean(), inplace=True)

In [129]:
dataset["embark_town"].fillna(dataset["embark_town"].mode()[0], inplace=True)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

C:\Users\Soham\AppData\Local\Temp\ipykernel_16728\4154844622.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["embark_town"].fillna(dataset["embark_town"].mode()[0], inplace=True)

In [130]:
dataset = dataset.drop(columns = ["deck", "embarked", "who", "alive", "class", "alone", "adult_male"])

In [131]:
le = LabelEncoder()
dataset["sex"] = le.fit_transform(dataset["sex"])
print(dataset["sex"])

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: sex, Length: 891, dtype: int64

In [132]:
def sex_to_val(sex: str):
    if sex == "male":
        return 1
    else: 
        return 0
    
dataset["sex"] = dataset["sex"].map(sex_to_val)

dataset.head()

   survived  pclass  sex   age  sibsp  parch     fare  embark_town
0         0       3    0  22.0      1      0   7.2500  Southampton
1         1       1    0  38.0      1      0  71.2833    Cherbourg
2         1       3    0  26.0      0      0   7.9250  Southampton
3         1       1    0  35.0      1      0  53.1000  Southampton
4         0       3    0  35.0      0      0   8.0500  Southampton

In [133]:
one_hot = OneHotEncoder()

x = dataset[["age", "sex", "fare", "embark_town", "pclass", "sibsp"]]
y = dataset["survived"]

preprocessor = ColumnTransformer(
    transformers= [("encoder" , one_hot, ["embark_town"])],
    remainder= "passthrough"
)
X = preprocessor.fit_transform(x)
feature_names = preprocessor.named_transformers_["encoder"].get_feature_names_out(["embark_town"])
final_feature_names = list(feature_names) + list(preprocessor.transformers_[-1][-1])

final_x = pd.DataFrame(X, columns=final_feature_names)
print(final_x)

     embark_town_Cherbourg  embark_town_Queenstown  embark_town_Southampton  \
0                      0.0                     0.0                      1.0
1                      1.0                     0.0                      0.0
2                      0.0                     0.0                      1.0
3                      0.0                     0.0                      1.0
4                      0.0                     0.0                      1.0
..                     ...                     ...                      ...
886                    0.0                     0.0                      1.0
887                    0.0                     0.0                      1.0
888                    0.0                     0.0                      1.0
889                    1.0                     0.0                      0.0
890                    0.0                     1.0                      0.0

           age  sex     fare  pclass  sibsp
0    22.000000  0.0   7.2500     3.0    1.0
1    38.000000  0.0  71.2833     1.0    1.0
2    26.000000  0.0   7.9250     3.0    0.0
3    35.000000  0.0  53.1000     1.0    1.0
4    35.000000  0.0   8.0500     3.0    0.0
..         ...  ...      ...     ...    ...
886  27.000000  0.0  13.0000     2.0    0.0
887  19.000000  0.0  30.0000     1.0    0.0
888  29.699118  0.0  23.4500     3.0    1.0
889  26.000000  0.0  30.0000     1.0    0.0
890  32.000000  0.0   7.7500     3.0    0.0

[891 rows x 8 columns]

In [134]:
"""print(dataset["fare"].dtype)

preprocessor = ColumnTransformer(
    transformers= [("cat" , one_hot, ["fare"])],
    remainder= "passthrough"
)
X = preprocessor.fit_transform(x)
feature_names = preprocessor.named_transformers_["encoder"].get_feature_names_out(["fare"])
final_feature_names = list(feature_names) + list(preprocessor.transformers_[-1][-1])

final_x = pd.DataFrame(X, columns=final_feature_names)
print(final_x)"""

'print(dataset["fare"].dtype)\n\npreprocessor = ColumnTransformer(\n    transformers= [("cat" , one_hot, ["fare"])],\n    remainder= "passthrough"\n)\nX = preprocessor.fit_transform(x)\nfeature_names = preprocessor.named_transformers_["encoder"].get_feature_names_out(["fare"])\nfinal_feature_names = list(feature_names) + list(preprocessor.transformers_[-1][-1])\n\nfinal_x = pd.DataFrame(X, columns=final_feature_names)\nprint(final_x)'